/*Напишите программу, которая выводит на консоль текст:

"Hello, World!"
\Dennis Ritchie\*/

#include <iostream>
using namespace std;

int main()
{
    cout << "\"Hello, World!\"\n";
    cout << "\\Dennis Ritchie\\";

    return 0;
}

